app/controllers/home_controller.rb

	def get_current_user_details
	    Rails.logger.info("[HOME] [get_current_user_details] Entering #{params}")

	    if params[:user_id] != "nil"
	    	@user_uid = params[:user_id]
	    else
	    	if !user_signed_in?
	      		Rails.logger.error("[CNTRL] [HOME] [get_current_user_details] ****USER NOT LOGGED IN****")
	      		render :json => {:error => "No user loggedin" }, :status => 400
	    	end
	    	@user_uid = current_user.srv_uid
	    end

	    Rails.logger.info("[HOME] [COMMON] current user id #{current_user.id}")
	    Rails.logger.info("[HOME] [COMMON] current user data #{current_user}")

	    response_json = {}

	    #info = User.where(:srv_uid => current_user.srv_uid).first
	    info = User.where(:srv_uid => @user_uid).first

	    response_json[:name] = info["name"]
	    response_json[:uid] = current_user.srv_uid
	    response_json[:sex] = info["sex"]
	    response_json[:pic] = info["pic"]
	    response_json[:vote_count] = info["vote_count"]
	    response_json[:auth_token] = current_user.access_token #session[:token]
	    response_json[:post_count] = info.posts.length
---
SELECT "users".* FROM "users" WHERE "users"."srv_uid" = '1452186072' LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

	def get_all_users

		response_json = User.all
---
SELECT "users".* FROM "users"