app/controllers/post_controller.rb

	def create_post
		Rails.logger.info("[CNTRL] [POST] [CREATE] New post create requested")
        if !user_signed_in?
          Rails.logger.error("[CNTRL] [HOME] [get_posts] ****USER NOT LOGGED IN****")
          render :json => {:error => "No user loggedin" }, :status => 400
        end
        Rails.logger.info("[HOME] [COMMON] current user id #{current_user.id}")
		Rails.logger.info("[CNTRL] [POST] [CREATE] params #{params.inspect}")

        h = {:user_id => current_user.id,
            :text => params["text"],
            :title => params["title"],
            :pic => params["imgSrc"]
        }

        p = Post.create_post(h)
---
INSERT INTO "posts" ("created_at", "pic", "text", "title", "updated_at", "user_id", "vote_count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update_vote
        Rails.logger.info("[POST][CNTL][update_vote] Entering #{params.inspect}")

        post = Post.where(:id => params["postID"].to_i).first
        Rails.logger.info("[POST] [update_vote] update #{post.inspect}")
        if !post.blank?
            user = post.user

            post_vote = post[:vote_count]
            user_vote = user[:vote_count]
            post.update_attribute(:vote_count,post_vote+1)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "vote_count" = 1, "updated_at" = '2012-09-24 18:30:15.145911' WHERE "posts"."id" = 1
UPDATE "users" SET "vote_count" = 1, "updated_at" = '2012-09-24 18:30:15.164377' WHERE "users"."id" = 1

    def get_posts
        Rails.logger.info("[CNTRL] [POST] [get_posts] enter #{params}");

        if params[:user_id] != "nil"
            @user_uid = User.find_by_srv_uid(params[:user_id])[:id]
        else
            if !user_signed_in?
                Rails.logger.error("[CNTRL] [HOME] [get_current_user_details] ****USER NOT LOGGED IN****")
                render :json => {:error => "No user loggedin" }, :status => 400
            end
            @user_uid = current_user.id
        end

        #if !user_signed_in?
        #  Rails.logger.error("[CNTRL] [POST] [get_posts] ****USER NOT LOGGED IN****")
        #  render :json => {:error => "No user loggedin" }, :status => 400
        #end

        #Rails.logger.info("[HOME] [COMMON] current user id #{session[:current_user_id]}")
        #Rails.logger.info("[POST] [COMMON] current user id #{current_user.id}")

        response_json = Post.where(:user_id => @user_uid).order('id DESC')
---
SELECT "users".* FROM "users" WHERE "users"."srv_uid" = '100003748290843' LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IS NULL ORDER BY id DESC

    def get_leaderboard_posts
        Rails.logger.info("[CNTRL] [POST] [get_leaderboard_posts] enter #{params}");

        response_json = []

        posts = Post.order('vote_count DESC').limit(10)
---
SELECT "posts".* FROM "posts" ORDER BY vote_count DESC LIMIT 10