app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("access_token", "authentication_token", "created_at", "current_sign_in_at", "current_sign_in_ip", "last_sign_in_at", "last_sign_in_ip", "name", "pic", "remember_created_at", "sex", "sign_in_count", "srv", "srv_uid", "updated_at", "username", "vote_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def facebook
    Rails.logger.info("[CNTRL] [USERS] [OmniauthCallbacks] [FACEBOOK] Entering")

    auth = request.env["omniauth.auth"]

    h = {:srv => auth.provider, :srv_uid => auth.uid, :access_token => auth.credentials.token}

    h[:name] = auth.info.name
    h[:pic] = auth.info.image
    h[:location] = auth.info.location

    if !auth.extra.blank? and !auth.extra.raw_info.blank?
      h[:username] = auth.extra.raw_info[:username],
      h[:sex] = auth.extra.raw_info.gender
    end

    user = User.create_user(h)